* Pipex
This project aims to simulate the pipe operator in bash.
** Quick overview
The pipe operator is used when we need an interaction between commands. For example, the command
#+begin_src bash
< file1 cat | head -5 > file2
#+end_src
means "execute the =cat= function with the file =file1= as input then the =head= function with the result of previous command as input and output the result in the file =file2=."

The pipex program is called like this:
#+begin_src bash
./pipex file1 cmd1 cmd2 file2
#+end_src
** How it works
In order to achieve this project, we will need to use multiple processes. To create a new process, the function =fork()= is used in C. Each command is run in a new process and processes communicate thanks to pipes, created with the =pipe(fd[2])= function.

For the first command, the input is =file1=. It means that we must open the file and redirect the standard input in the new process to the file descriptor of =file1=. The standard output will be redirected to the write end of the pipe (=fd[1]=).

The second command will take the read end of the pipe (=fd[0]=) and the =file2= as standard output.
** Bonus part
There are 2 bonuses in this project.
*** Bonus part 1
The first bonus is about handling multiple commands as such:
#+begin_src bash
./pipex infile cmd1 cmd2 cmd3 ... outfile
#+end_src
In order to achieve that goal, I use 2 pipes one after another to provide an input and an output to each command. The difficult part is to correctly handle pipes opening and closing at the good time.
*** Bonus part 2
The second bonus is about handling the "here doc". Here doc operator is =<<= and allows to get an input of multiple lines until a defined delimiter is written to the input. The program must behave like the command
#+begin_src bash
cmd << END | cmd2 >> outfile
#+end_src
In this command, the first command has as input the standard input and we can write anything, including newlines, until we write "END". Our program will be called like this:
#+begin_src bash
./pipex here_doc DELIMITER cmd1 cmd2 outfile
#+end_src

Handling this bonus is quite easy because we just need to use our =get_next_line(fd)= function and write each line to the first input pipe until the delimiter is found.
*** Program sequence with all bonuses
To handle all the bonuses, here are the most important parts of  my program sequence:
1. If the input is the here_doc, create a first pipe (that we will call pipe_in) and get the stdin with =get_next_line= and write lines to the pipe
2. Create a pipe for the output (pipe_out)
3. Create a new process (the first)
   1. In this new process, if the input is a file, then open it
   2. Redirect *stdin* to the *pipe_in* or *the infile*
   3. Redirect *stdout* to the *pipe_out*
   4. Run the command
4. For all the commands before the last:
   1. Close the last pipe_in
   2. Create a new pipe as pipe_out
   3. Create a new process in which *stdin* is redirected to *pipe_in* and *stdout* to *pipe_out* then run the command
5. For the last command:
   1. Close the last pipe_in
   2. Open the outfile
   3. Create a new process in wich *stdin* is redirected to *pipe_in* and *stdout* to *outfile*
6. Exit the programm with the last process exit code.

To run a command, =execve()= is used. This function needs the absolute path to the command, the list of the options provided with the command (as an array of strings) and the environment array. Since the commands can be written without their absolute path, we need to find it. In order to do that, We need to find the *path variable* in the *env* array and try to run execve with it. If the function returns anything, it means it failed so we try with the next path until the function succeeds.
* Time spent
** DONE Pipex
CLOSED: [2024-06-30 Sun 09:47]
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:Effort:   50:00
:END:
*** DONE reduce pipes number for here_doc
CLOSED: [2024-06-26 Wed 10:09]
*** DONE Recode pipex
CLOSED: [2024-06-30 Sun 09:47]
:LOGBOOK:
CLOCK: [2024-06-27 Thu 18:36]--[2024-06-27 Thu 18:56] =>  0:20
CLOCK: [2024-06-27 Thu 10:16]--[2024-06-27 Thu 11:34] =>  1:18
CLOCK: [2024-06-26 Wed 11:03]--[2024-06-26 Wed 12:38] =>  1:35
CLOCK: [2024-06-26 Wed 10:15]--[2024-06-26 Wed 10:41] =>  0:26
CLOCK: [2024-06-26 Wed 09:04]--[2024-06-26 Wed 10:04] =>  1:00
CLOCK: [2024-06-25 Tue 21:22]--[2024-06-26 Wed 01:48] =>  4:26
:END:
*** CODED pipex program
CLOSED: [2024-06-30 Sun 09:47]
:LOGBOOK:
CLOCK: [2024-06-23 Sun 18:35]--[2024-06-23 Sun 20:18] =>  1:43
CLOCK: [2024-06-23 Sun 17:16]--[2024-06-23 Sun 18:34] =>  1:18
CLOCK: [2024-06-23 Sun 16:20]--[2024-06-23 Sun 17:11] =>  0:51
CLOCK: [2024-06-22 Sat 19:34]--[2024-06-22 Sat 21:31] =>  1:57
CLOCK: [2024-06-22 Sat 17:32]--[2024-06-22 Sat 18:38] =>  1:06
CLOCK: [2024-06-22 Sat 16:13]--[2024-06-22 Sat 17:22] =>  1:09
CLOCK: [2024-06-20 Thu 19:18]--[2024-06-20 Thu 19:38] =>  0:20
CLOCK: [2024-06-20 Thu 17:48]--[2024-06-20 Thu 18:57] =>  1:09
CLOCK: [2024-06-20 Thu 14:21]--[2024-06-20 Thu 14:57] =>  0:36
CLOCK: [2024-06-20 Thu 14:10]--[2024-06-20 Thu 14:12] =>  0:02
CLOCK: [2024-06-20 Thu 14:08]--[2024-06-20 Thu 14:10] =>  0:02
CLOCK: [2024-06-20 Thu 13:23]--[2024-06-20 Thu 13:57] =>  0:34
CLOCK: [2024-06-19 Wed 12:13]--[2024-06-19 Wed 14:14] =>  2:01
:END:
*** DONE document, test, repo orga
CLOSED: [2024-06-30 Sun 09:47]
:LOGBOOK:
CLOCK: [2024-06-20 Thu 18:57]--[2024-06-20 Thu 19:17] =>  0:20
CLOCK: [2024-06-19 Wed 11:24]--[2024-06-19 Wed 12:12] =>  0:48
CLOCK: [2024-06-18 Tue 18:12]--[2024-06-18 Tue 18:33] =>  0:21
CLOCK: [2024-06-18 Tue 12:01]--[2024-06-18 Tue 12:17] =>  0:16
CLOCK: [2024-06-17 Mon 15:08]--[2024-06-17 Mon 15:45] =>  0:37
:END:
